{-# LANGUAGE OverloadedStrings #-}
{-# LANGUAGE QuasiQuotes #-}

module Text.Greek.Mounce.Adjective where

import Text.Greek.Grammar
import Text.Greek.Mounce.Morphology
import Text.Greek.Mounce.Quote

adjectives :: [Cited AdjectiveCategory]
adjectives = 
  [ mounce § "a-1a(1)" $
    [adjectiveCategory|
      Uncontracted stems using three endings (2-1-2) with the feminine in α
              m:  f:  n:
      nom sg: ος  α   ον
      gen sg: ου  ας  ου
      dat sg: ῳ   ᾳ   ῳ
      acc sg: ον  αν  ον
      voc sg: ε   α   ον
      nom pl: οι  αι  α
      gen pl: ων  ων  ων
      dat pl: οις αις οις
      acc pl: ους ας  α
      voc pl: οι  αι  α
      lemmas:
        ἅγιος ἄγριος Ἀθηναῖος αἴγειος Αἰγύπτιος
        αἰσχρός αἴτιος ἀκρογωνιαῖος ἀλλότριος ἀμφότεροι
        ἀναγκαῖος ἄξιος ἀργύρεος ἄρειος ἀριστερός
        ἄρτιος ἀρχαῖος ἀστεῖος αὐστηρός αὐχμηρός
        βέβαιος Βεροιαῖος βίαιος βλαβερός βλητέος
        Γαλιλαῖος γνήσιος γυναικεῖος Δερβαῖος δεξιός
        δευτεραῖος δεύτερος δημόσιος διακόσιοι δίκαιος
        δισχίλιοι δόλιος ἑκούσιος ἐλαφρός ἐλεύθερος
        ἐναντίος ἐνεός ἐννεός ἐντόπιος ἑξακόσιοι
        ἐπιτήδειος ἐπτακισχίλιοι ἐρυθρός ἕτερος Ἐφεσῖνος
        Ἐφέσιος ἐχθρός ἡμέτερος ἤπιος θαυμάσιος
        θεῖος ἴδιος ἱερός ἱλαρός Ἰουδαῖος
        ἰσχυρός Ἰτουραῖος καθαρός κραταιός κρυφαῖος
        κρύφιος λαμπρός λεῖος λεπρός λιπαρός
        λόγιος μακάριος μακρός μάταιος μεγαλεῖος
        μικρός μύριοι μυρίος μωρός νεκρός
        νέος νήπιος νηφαλέος νηφάλιος νωθρός
        ξηρός οἷος ὀκνηρός ὅμοιος ὁποῖος
        ὄρθριος ὅσιος ὄψιος παλαιός παραθαλάσσιος
        παραπλήσιος πατρῷος πενιχρός πεντακισχίλιοι πεντακόσιοι
        περαιτέρος πικρός Πισίδιος πλούσιος ποῖος
        πονηρός πυρρός ῥυπαρός Ῥωμαῖος σαπρός
        Σιδώνιος σκληρός σκολιός Σμυρναῖος σπουδαῖος
        στερεός ταλαντιαῖος τέλειος τεταρταῖος τετρακισχίλιοι
        τίμιος τριακόσιοι τρισχίλιοι ὑγρός ὑμέτερος
        ὑπεναντίος ὕστερος φανερός φοβερός χάλκεος
        Χαναναῖος χίλιοι χλιαρός χλωρός χρύσεος
        ψυχρός ὡραῖος
    |]
  ]
