{-# LANGUAGE OverloadedStrings #-}
{-# LANGUAGE QuasiQuotes #-}

module Text.Greek.Mounce.Adjective where

import Text.Greek.Grammar
import Text.Greek.Mounce.Morphology
import Text.Greek.Mounce.Quote

adjectives :: [Cited AdjectiveCategory]
adjectives = 
  [ mounce § "a-1a(1)" $
    [adjectiveCategory|
      Uncontracted stems using three endings (2-1-2) with the feminine in α
              m:  f:  n:
      nom sg: ος  α   ον
      gen sg: ου  ας  ου
      dat sg: ῳ   ᾳ   ῳ
      acc sg: ον  αν  ον
      voc sg: ε   α   ον
      nom pl: οι  αι  α
      gen pl: ων  ων  ων
      dat pl: οις αις οις
      acc pl: ους ας  α
      voc pl: οι  αι  α
      lemmas:
        ἅγιος ἄγριος Ἀθηναῖος αἴγειος Αἰγύπτιος
        αἰσχρός αἴτιος ἀκρογωνιαῖος ἀλλότριος ἀμφότεροι
        ἀναγκαῖος ἄξιος ἀργύρεος ἄρειος ἀριστερός
        ἄρτιος ἀρχαῖος ἀστεῖος αὐστηρός αὐχμηρός
        βέβαιος Βεροιαῖος βίαιος βλαβερός βλητέος
        Γαλιλαῖος γνήσιος γυναικεῖος Δερβαῖος δεξιός
        δευτεραῖος δεύτερος δημόσιος διακόσιοι δίκαιος
        δισχίλιοι δόλιος ἑκούσιος ἐλαφρός ἐλεύθερος
        ἐναντίος ἐνεός ἐννεός ἐντόπιος ἑξακόσιοι
        ἐπιτήδειος ἐπτακισχίλιοι ἐρυθρός ἕτερος Ἐφεσῖνος
        Ἐφέσιος ἐχθρός ἡμέτερος ἤπιος θαυμάσιος
        θεῖος ἴδιος ἱερός ἱλαρός Ἰουδαῖος
        ἰσχυρός Ἰτουραῖος καθαρός κραταιός κρυφαῖος
        κρύφιος λαμπρός λεῖος λεπρός λιπαρός
        λόγιος μακάριος μακρός μάταιος μεγαλεῖος
        μικρός μύριοι μυρίος μωρός νεκρός
        νέος νήπιος νηφαλέος νηφάλιος νωθρός
        ξηρός οἷος ὀκνηρός ὅμοιος ὁποῖος
        ὄρθριος ὅσιος ὄψιος παλαιός παραθαλάσσιος
        παραπλήσιος πατρῷος πενιχρός πεντακισχίλιοι πεντακόσιοι
        περαιτέρος πικρός Πισίδιος πλούσιος ποῖος
        πονηρός πυρρός ῥυπαρός Ῥωμαῖος σαπρός
        Σιδώνιος σκληρός σκολιός Σμυρναῖος σπουδαῖος
        στερεός ταλαντιαῖος τέλειος τεταρταῖος τετρακισχίλιοι
        τίμιος τριακόσιοι τρισχίλιοι ὑγρός ὑμέτερος
        ὑπεναντίος ὕστερος φανερός φοβερός χάλκεος
        Χαναναῖος χίλιοι χλιαρός χλωρός χρύσεος
        ψυχρός ὡραῖος
    |]

  , mounce § "a-3a" $
    [adjectiveCategory|
      Stems consistently using two endings (2-2)
              mf: n:
      nom sg: ος  ον
      gen sg: ου  ου
      dat sg: ῳ   ῳ
      acc sg: ον  ον
      voc sg: ε   ον
      nom pl: οι  α
      gen pl: ων  ων
      dat pl: οις οις
      acc pl: ους α
      voc pl: οι  α
      lemmas:
        ἀγαθοεργός ἀγαθοποιός ἀγενεαλόγητος ἄγναφος ἄγνωστος
        ἀγοραῖος ἀγράμματος ἀδάπανος ἄδηλος ἀδιάκριτος
        ἀδιάλειπτος ἄδικος ἀδόκιμος ἄδολος ἀδύνατος
        ἄζυμος ἀθέμιτος ἄθεος ἄθεσμος ἀθῷος
        ἀΐδιος αἰφνίδιος ἀκάθαρτος ἄκακος ἄκαρπος
        ἀκατάγνωστος ἀκατακάλυπτος ἀκατάκριτος ἀκατάλυτος ἀκατάπαστος
        ἀκατάπαυστος ἀκατάστατος ἀκατάσχετος ἀκέραιος ἄκρατος
        ἀλάλητος ἄλαλος ἀλλόφυλος ἄλογος ἄλυπος
        ἀμάραντος ἀμάρτυρος ἀμαρτωλός ἄμαχος ἄμεμπτος
        ἀμέριμνος ἀμετάθετος ἀμετακίνητος ἀμεταμέλητος ἀμετανόητος
        ἄμετρος ἀμίαντος ἀμώμητος ἄμωμος ἀναίτιος
        ἄναλος ἀναμάρτητος ἀναντίρρητος ἀνάξιος ἀνάπειρος
        ἀνάπηρος ἀναπολόγητος ἀναρίθμητος ἀνέγκλητος ἀνεκδιήγητος
        ἀνεκλάλητος ἀνέκλειπτος ἀνεκτός ἀνέλεος ἀνένδεκτος
        ἀνεξεραύνητος ἀνεξίκακος ἀνεξιχνίαστος ἀνεπαίσχυντος ἀνεπίλημπτος
        ἀνεύθετος ἀνήμερος ἀνθρωπάρεσκος ἄνιπτος ἀνόητος
        ἄνομος ἀνόνητος ἀνόσιος ἀντίτυπος ἄνυδρος
        ἀνυπόκριτος ἀνυπότακτος ἀόρατος ἀπαίδευτος ἀπαράβατος
        ἀπαρασκεύαστος ἀπείραστος ἄπειρος ἀπέραντος ἀπερίτμητος
        ἄπιστος ἀπόβλητος ἀπόδεκτος ἀπόδημος ἀπόκρυφος
        ἀποσυνάγωγος ἀπρόσιτος ἀπρόσκοπος ἄπταιστος ἄραφος
        ἄρρητος ἄρρωστος ἀρτιγέννητος ἀρχιερατικός ἀσάλευτος
        ἄσβεστος ἄσημος ἄσιτος ἄσοφος ἄσπιλος
        ἄσπονδος ἀστήρικτος ἄστοργος ἀσύμφωνος ἀσύνετος
        ἀσύνθετος ἄτακτος ἄτεκνος ἄτιμος ἄτομος
        ἄτοπος αὐθαίρετος αὐτοκατάκριτος αὐτόφωρος ἄφαντος
        ἄφθαρτος ἀφιλάγαθος ἀφιλάργυρος ἄφωνος ἀχάριστος
        ἀχειροποίητος ἀχρεῖος ἄχρηστος ἄψυχος βάρβαρος
        βαρύτιμος βασίλειος βέβηλος βλάσφημος βοηθός
        βρώσιμος γενέθλιος γνώριμος δευτερόπρωτος διάβολος
        διάφορος δίγαμος διθάλασσος δίλογος δίστομος
        δίψυχος δόκιμος δυσβάστακτος δυσερμήνευτος δύσκολος
        δυσνόητος ἔγγυος ἐγκάθετος ἔγκυος εἰδωλόθυτος
        εἰρηνοποιός ἔκγονος ἔκδηλος ἔκδικος ἔκδοτος
        ἔκθαμβος ἔκθετος ἔκτρομος ἔκφοβος ἔμφοβος
        ἔμφυτος ἐνάλιος ἔνδικος ἔνδοξος ἔννομος
        ἔννυχος ἔνοχος ἔντιμος ἔντρομος ἔξυπνος
        ἐπάρατος ἐπάρχειος ἐπαυτόφωρος ἐπίγειος ἐπιθανάτιος
        ἐπικατάρατος ἐπίλοιπος ἐπίορκος ἐπιούσιος ἐπιπόθητος
        ἐπίσημος ἐπουράνιος ἔρημος ἑτερόγλωσσος εὐάρεστος
        εὔθετος εὔθυμος εὔκαιρος εὔκοπος εὐμετάδοτος
        εὐπάρεδρος εὐπερίσπαστος εὐπερίστατος εὐπρόσδεκτος εὐπρόσεδρος
        εὐρύχωρος εὔσημος εὔσπλαγχνος εὔφημος εὐχάριστος
        εὔχρηστος εὐώνυμος ἐφήμερος ἤρεμος ἡσύχιος
        θανάσιμος θανατηφόρος θεοδίδακτος θεοδίδακτος θεομάχος
        θεόπνευστος θρησκός ἱερόθυτος ἰσάγγελος ἰσότιμος
        ἰσόψυχος κακοποιός κακοῦργος καλοδιδάσκαλος καρποφόρος
        κατάδηλος κατάλαλος κατάλοιπος καταχθόνιος κατείδωλος
        κενόδοξος λιθόστρωτος μακροχρόνιος ματαιολόγος μελίσσιος
        μεμψίμοιρος μέτοχος μογγιλάλος μογιλάλος μονόφθαλμος
        νεόφυτος οἰκουργός οἰκουρός ὀκταήμερος ὀλέθριος
        ὀλιγόπιστος ὀλιγόψυχος ὁλόκληρος ὁμότεχνος οὐράνιος
        ὄψιμος πανοῦργος παράδοξος παράλιος παράσημος
        παρείσακτος παρεπίδημος πάροικος πάροινος πατροπαράδοτος περίεργος περίλυπος περίοικος περιούσιος
        περίχωρος πλάνος πολύλαλος πολυποίκιλος πολύσπλαγχνος
        πολυεύστλαγχνος πολύτιμος πορφύρεος ποταμοφόρητος πρόγονος
        πρόδηλος πρόδρομος πρόθυμος πρόϊμος πρόσκαιρος
        πρόσπεινος πρόσφατος πρώϊμος πρωτότοκος σητόβρωτος
        σκληροτράχηλος σκωληκόβρωτος σπερμολόγος σπόριμος συγκληρονόμος
        συμμέτοχος σύμμορφος σύμφορος σύμφυτος σύμφωνος
        σύμψυχος σύντροφος σύσσωμος σωτήριος ταλαίπωρος
        τετράγωνος τετράμηνος τρίμηνος ὕπανδρος ὑπέρακμος
        ὑπερήφανος ὑπέρογκος ὑπήκοος ὑπόδικος φιλάγαθος
        φιλάδελφος φίλανδρος φιλάργυρος φίλαυτος φιλήδονος
        φιλόθεος φιλόνεικος φιλόξενος φιλόστοργος φιλότεκνος
        φλύαρος φρόνιμος φωσφόρος χειροποίητος χρυσοδακτύλιος ψευδολόγος ψευδώνυμος ὠφέλιμος
    |]
  ]
