{-# LANGUAGE OverloadedStrings #-}
{-# LANGUAGE QuasiQuotes #-}

module Text.Greek.Mounce.NounFirstDeclension where

import Text.Greek.Grammar
import Text.Greek.Mounce.Morphology
import Text.Greek.Mounce.Quote

firstDeclensionNouns :: [Cited Noun]
firstDeclensionNouns = 
  [ mounce § "n-1a" $
    Noun "Feminine nouns with stems ending in εα, ια, or ρα and a genitive in ας"
      [nounCaseEndings|
        - ι   
        ς ων
        ι ις
        ν νς
      |]
      [greekWords| Ἅννα Εὕα Ἱεροσόλυμα Ἰωάνα Ἰωάννα Μάρθα Νύμφα Ῥεβέκκα στοά |]
      [greekWords|
        ἀγαθοποιΐα ἀγγελία ἄγκυρα ἁγνεία ἄγνοια
        ἀγνωσία ἀγορά ἄγρα ἀγρυπνία ἀγωνία
        ἀδιαφθορία ἀδικία ἀηδία ἀθανασία ἀιματεκχυσία
        αἰσχρολογία αἰτία αἰχμαλωσία ἀκαθαρσία ἀκαταστασία
        ἀκρασία ἀκρίβεια ἀκροβυστία ἀλαζονεία ἀλεκτοροφωνία
        ἀλήθεια ἀμαρτία ἀναίδεια ἀναλογία ἀνεγκλησία
        ἀνθρακιά Ἅννα ἄνοια ἀνομία ἀντιλογία
        ἀντιμισθία Ἀντιόχεια ἀπείθεια ἀπιστία ἀποκαραδοκία
        Ἀπολλωνία ἀπολογία ἀπορία ἀποστασία ἀποτομία
        ἀπουσία Ἀπφία ἀπώλεια ἀρά Ἀραβία
        ἀρεσκεία Ἁριμαθαία ἀσέβεια ἀσέλγεια ἀσθένεια
        Ἀσία ἀσιτία ἀσφάλεια ἀσωτία ἀτιμία
        Ἀττάλεια αὐτάρκεια ἀφειδία ἀφθαρσία ἀφθονία
        ἀφθορία Ἀχαΐα βασιλεία Βέροια Βηθαβαρά
        Βηθανία βία Βιθυνία βλασφημία βοήθεια
        Γαλατία Γαλιλαία Γαλλία γενεά γενεαλογία
        γερουσία Γόμορρα γυμνασία γωνία Δαλματία
        δειλία δεισιδαιμονία διακονία διάνοια διασπορά
        διαφθορά διγαμία διδασκαλία διερμηνεία διετία
        δικαιοκρισία διχοστασία δοκιμασία δουλεία δυσεντερία
        δυσφημία δωρεά δωροφορία ἐγκράτεια ἐθελοθρησκία
        εἰδέα εἰδωλολατρία εἰλικρίνεια ἐκκλησία ἐκτένεια
        ἐλαία ἐλαφρία ἐλευθερία ἐμπορία ἐνέδρα
        ἐνέργεια ἔννοια ἐξουσία ἐπαγγελία ἐπαρχεία
        ἐπιείκεια ἐπιθυμία ἐπικουρία ἐπιμέλεια ἐπίνοια
        ἐπιποθία ἐπιτιμία ἐπιφάνεια ἐπιχορηγία ἐργασία
        ἐρημία ἐριθεία ἑρμηνεία ἑσπέρα ἑτοιμασία
        Εὕα εὐγλωττία εὐγλωττία εὐδία εὐδοκία
        εὐεργεσία εὐκαιρία εὐλάβεια εὐλογία εὔνοια
        Εὐοδία εὐοχία εὐποιΐα εὐπορία εὐπρέπεια
        εὐσέβεια εὐτραπελία εὐφημία εὐχαριστία εὐωδία
        εὐωχία ἐφημερία ἔχθρα ζευκτηρία ζημία
        ἡγεμονία ἡλικία ἡμέρα ἡσυχία θεά
        θεοσέβεια θεραπεία Θεσσαλία θεωρία θήρα
        θρησκεία θύρα θυσία ἰδέα Ἰδουμαία
        ἱερατεία Ἱεροσόλυμα ἱκετηρία Ἰουδαία Ἰουλία
        Ἰταλία Ἰωάνα Ἰωάννα καθέδρα Καισάρεια
        κακία κακοήθεια κακοπάθεια κακοπαθία καλοκαγαθία
        Καππαδοκία καραδοκία καρδία καταλαλιά κατάρα
        κατηγορία κατήφεια κατοικία Κεγχρεαί κειρία
        κενοδοξία κενοφωνία κεραία κιθάρα Κιλικία
        Κλαυδία κληρονομία κλισία κοιλία κοινωνία
        κολακεία κολυμβήθρα κολωνία κοπρία κουστωδία
        κυβεία κυρία λαλιά Λαοδίκεια Λασαία
        Λασέα λατρεία λειτουργία Λέκτρα λέπρα
        λίτρα λογεία λογομαχία λοιδορία Λυδία
        Λυκαονία Λυκία Λύστρα λυχνία μαγεία
        μαθήτρια Μακεδονία μακροθυμία μαλακία μανία
        Μάρθα Μαρία μαρτυρία ματαιολογία μεθοδεία
        μεσημβρία Μεσοποταμία μετάνοια μετοικεσία μήτρα
        μισθαποδοσία μνεία μοιχεία Μυσία μωρία
        μωρολογία νεομηνία νηστεία νομοθεσία νοσσιά
        νουθεσία νουμηνία Νύμφα ξενία ὁδοιπορία
        οἰκετεία οἰκία οἰκοδομία οἰκονομία οἰνοφλυγία
        ὀλιγοπιστία ὁλοκληρία ὁμιλία ὁμολογία ὀπτασία
        ὀπώρα ὀργυιά ὁρκωμοσία ὁροθεσία οὐρά
        οὐσία ὀφθαλμοδουλία ὀψία παιδεία παλιγγενεσία
        Παμφυλία πανοπλία πανουργία παραγγελία παραμυθία
        παρανομία παραφρονία παραχειμασία παρηγορία παρθενία
        παροικία παροιμία παρουσία παρρησία πατριά
        πεῖρα πενθερά Πέραια περικεφαλαία περισσεία
        περιστερά πέτρα πήρα πιθανολογία πικρία
        Πισιδία πλατεῖα πλεονεξία πλευρά πληροφορία
        ποία πολιτεία πολυλογία πολυπλήθεια πονηρία
        πορεία πορία πορνεία πορφύρα πραγματεία
        πρασιά πραϋπάθεια πρεσβεία προθεσμία προθυμία
        πρόνοια προσδοκία προσφορά προσωπολημψία προσωποληψία
        προφητεία πρωΐα πρωτοκαθεδρία πρωτοκλισία πτωχεία
        πυρά ῥᾳδιουργία Ῥεβέκκα ῥομφαία ῥυπαρία
        Σαμάρεια Σαμαρία Σάρρα σειρά Σελεύκεια
        σκηνοπηγία σκιά σκληροκαρδία σκοτία σοφία
        Σπανία σπορά στεῖρα στενοχωρία στοά
        στρατεία στρατιά συγγένεια συγκυρία συκομορέα
        συμποσία συμφωνία συνήθεια συνοδία συνορία
        συντέλεια συντυχία συνωμοσία Σύρα Ευρία
        σωτηρία ταλαιπωρία τεκνογονία τιμωρία τριετία
        τροχιά τρυμαλία ὑδρία υἱοθεσία ὑπερηφανία
        ὑπόνοια φαντασία φαρμακεία φθορά Φιλαδέλφεια
        φιλαδελφία φιλανθρωπία φιλαργυρία φιλία φιλονεικία
        φιλοξενία φιλοσοφία Φρυγία φυτεία χαρά
        χήρα χρεία χρηστολογία χώρα ψευδομαρτυρία
        ὥρα ὠφέλεια
      |]
  ]
