{-# LANGUAGE OverloadedStrings #-}
{-# LANGUAGE QuasiQuotes #-}

module Text.Greek.Mounce.Adjective where

import Text.Greek.Grammar
import Text.Greek.Mounce.Morphology
import Text.Greek.Mounce.Quote

adjectives :: [Cited AdjectiveCategory]
adjectives = 
  [Cited ([Citation mounce (Section "a-1a(1)"), Citation mounce (Section "a-3b(1)"), Citation mounce (Page 220)]) 
    [adjectiveCategory|
      Uncontracted stems using three endings (2-1-2) with the feminine in α | comparative and superlative adjectives
              m:  f:  n:
      nom sg: ος  α   ον
      gen sg: ου  ας  ου
      dat sg: ῳ   ᾳ   ῳ
      acc sg: ον  αν  ον
      voc sg: ε   α   ον
      nom pl: οι  αι  α
      gen pl: ων  ων  ων
      dat pl: οις αις οις
      acc pl: ους ας  α
      voc pl: οι  αι  α
      lemmas:
        ἅγιος ἄγριος Ἀθηναῖος αἴγειος Αἰγύπτιος
        αἰσχρός αἴτιος ἀκρογωνιαῖος ἀλλότριος ἀμφότεροι
        ἀναγκαῖος ἄξιος ἀργύρεος ἄρειος ἀριστερός
        ἄρτιος ἀρχαῖος ἀστεῖος αὐστηρός αὐχμηρός
        βέβαιος Βεροιαῖος βίαιος βλαβερός βλητέος
        Γαλιλαῖος γνήσιος γυναικεῖος Δερβαῖος δεξιός
        δευτεραῖος δεύτερος δημόσιος διακόσιοι δίκαιος
        δισχίλιοι δόλιος ἑκούσιος ἐλαφρός ἐλεύθερος
        ἐναντίος ἐνεός ἐννεός ἐντόπιος ἑξακόσιοι
        ἐπιτήδειος ἐπτακισχίλιοι ἐρυθρός ἕτερος Ἐφεσῖνος
        Ἐφέσιος ἐχθρός ἡμέτερος ἤπιος θαυμάσιος
        θεῖος ἴδιος ἱερός ἱλαρός Ἰουδαῖος
        ἰσχυρός Ἰτουραῖος καθαρός κραταιός κρυφαῖος
        κρύφιος λαμπρός λεῖος λεπρός λιπαρός
        λόγιος μακάριος μακρός μάταιος μεγαλεῖος
        μικρός μύριοι μυρίος μωρός νεκρός
        νέος νήπιος νηφαλέος νηφάλιος νωθρός
        ξηρός οἷος ὀκνηρός ὅμοιος ὁποῖος
        ὄρθριος ὅσιος ὄψιος παλαιός παραθαλάσσιος
        παραπλήσιος πατρῷος πενιχρός πεντακισχίλιοι πεντακόσιοι
        περαιτέρος πικρός Πισίδιος πλούσιος ποῖος
        πονηρός πυρρός ῥυπαρός Ῥωμαῖος σαπρός
        Σιδώνιος σκληρός σκολιός Σμυρναῖος σπουδαῖος
        στερεός ταλαντιαῖος τέλειος τεταρταῖος τετρακισχίλιοι
        τίμιος τριακόσιοι τρισχίλιοι ὑγρός ὑμέτερος
        ὑπεναντίος ὕστερος φανερός φοβερός χάλκεος
        Χαναναῖος χίλιοι χλιαρός χλωρός χρύσεος
        ψυχρός ὡραῖος 

        αἰώνιος ἑδραῖος κόσμιος οἰκεῖος παρόμοιος

        ἀλυπότερος ἀναγκαιότερος ἀνεκτότερος ἀνώτερος ἀσθενέστερος
        ἀτιμότερος βαρύτερος βεβαιότερος δεισιδαιμονέστερος διαφορώτερος 
        διπλότερος ἐλαχιστότερος ἐλεεινότερος ἐντιμότερος ἐξώτερος
        ἐσώτερος εὐγενέστερος εὐκοπώτερος ἰσχυρότερος καινότερος
        κατώτερος μακαριώτερος μειζότερος μικρότερος νεώτερος
        περισσότερος πολυτιμότερος πονηρότερος πρεσβύτερος πρότερος
        σοφώτερος σπουδαιότερος τελειότερος τομώτερος ὕστερος
        ὑψηλότερος φρονιμώτερος ἁγιώτατος ἀκριβέστατος κράτιστος
        τιμιώτατος
    |]
    -- what should we do with irregularly formed superlatives? Pg. 221
   , mounce §§ ["a-1a(2a)", "a-3b(2)"] $
     [adjectiveCategory|
      Uncontracted stems using three endings (2-1-2) with the feminine in η and neuter in ον
              m:  f:  n:
      nom sg: ος  η   ον
      gen sg: ου  ης  ου
      dat sg: ῳ   ῃ   ῳ
      acc sg: ον  ην  ον
      voc sg: ε   η   ον
      nom pl: οι  αι  α
      gen pl: ων  αν  ων
      dat pl: οις αις οις
      acc pl: ους ας  α
      voc pl: οι  αι  α
      lemmas:
      	ἀγαθός ἀγαπητός ἁγιώτατος ἁγνός Ἀδραμυττηνός
      	αἱρετικός ἀκάνθινος ἀκριβέστατος Ἀλεξανδρῖνος ἀληθινός
      	ἁλυκός ἀμαράντινος ἀνατολικός ἀνθρώπινος ἀνωτερικός
      	ἁπαλός ἀργός ἀρεστός ἀρκετός αὐτόματος 
      	βασιλικός βδελυκτός βιωτικός βύσσινος Γαδαρηνός
      	Γαλατικός γεννητός Γερασηνός Γεργεσηνός γνωστός 
      	γραπτός γυμνός Δαμασκηνός δειλός δεινός
      	δέκατος δεκτός δερμάτινος δῆλος διδακτικός
      	διδακτός διπλόος δυνατός δωδέκατος ἕβδομος
      	Ἑβραϊκός ἐθνικός εἰρηνικός ἕκαστος ἐκλεκτός
      	ἕκτος ἐλάχιστος ἐλεεινός ἐλεφάντινος Ἑλληνικός
      	ἐμός ἔνατος ἑνδέκατος ἐξουσιαστικός ἐπαρχικός
      	ἑσπερινός ἔσχατος εὐλογητός ζεστός ἡλίκος
      	θαυμαστός θνητός θύϊνος ἱκανός Ἰουδαϊκός 
      	ἱππικός ἴσος Ἰταλικός καθημερινός καθολικός
	  	  καινός κακός καλός κενός κεραμικός
      	κλητός κοινός κοινωνικός κενός κεραμικός
      	κόκκινος κοσμικός κράτιστος κρίθινος κριτικός
      	κρυπτός κυλλός κυριακός κωφός λαξευτός
      	λειτουργικός λεπτός Λευιτικός λευκοβύσσινος λευκός
      	λίθινος λογικός λοιπός μαλακός
      	μέγιστος μέσος μεστός μόνος μουσικός
      	μυλικός μύλινος μυλωνικός Ναζαρηνός νεωτερικός
      	νόθος νομικός ξένος ξύλινος ὄγδοος
      	ὀλίγος ὅλος ὀνικός ὀπτός ὁρατός 
      	ὀργίλος ὀρεινός ὀρθός ὀρθρινός ὀρφανός
      	ὅσος ὀστράκινος παθητός Πακατιανός
      	παραλυτικός πατρικός πεδινός πεζός πειθός
      	πέμπτος πεντεκαιδέκατος περισσός πηλίκος πιθός
	  	  πιστικός πιστός πλαστός πλεῖστος πνευματικός
      	πνικτός ποδαπός ποικίλος Ποντικός
      	πόσος ποταπός πρᾶος προβατικός προφητικός
      	πρωϊνός πρῶτος πτωχός πυκνός πύρινος
      	Ῥωμαϊκός σαρκικός σάρκινος σεβαστός σεμνός
      	σηρικός σιδήρεος σιρικός σιτευτός σιτιστός
      	σκοτεινός σμαράγδινος σός σοφός στενός
      	Στοϊκός στυγητός Στωϊκός συνεκλεκτός συνετός
      	συστατικός σωματικός τακτός ταπεινός ταχινός
      	τεσσαρεσκαιδέκατος τέταρτος τετρακόσιοι τετραπλόος τιμιώτατος
     	  τομός τρίτος τρίχινος τυφλός τυφωνικός
     	  ὑακίνθινος ὑάλινος ὑδρωπικός ὑφαντός ὑψηλός
      	φαῦλος φθαρτός φθινοπωρινός φίλος φυσικός
      	φωτεινός χαλεπός χοϊκός χρήσιμος χρηστός
     	  χωλός ψυχικός 

        ἕτοιμος πτηνός σκυθρωπός
    |]
     -- Mounce includes: καλοι Λιμένες καταμόνας μέγας πάμπολυς πολύς
   , Cited ([Citation mounce (Section "a-1a(2b)"), Citation mounce (Page 226)])
     [adjectiveCategory|
      Special Paradigm: μέγας
              m:       f:       n:
      nom sg: μέγας    μεγάλη   μέγα
      gen sg: μεγάλου  μεγάλη   μέγα
      dat sg: μεγάλῳ   μεγάλῃ   μεγάλῳ
      acc sg: μέγαν    μεγάλην  μέγα
      voc sg: *        *        *
      nom pl: μεγάλοι  μεγάλαι  μεγάλα
      gen pl: μεγάλων  μεγάλων  μεγάλων
      dat pl: μεγάλοις μεγάλαις μεγάλοις
      acc pl: μεγάλους μεγάλας  μεγάλα
      voc pl: *        *        *
      lemmas:
      	μέγας
	  |]
   , Cited ([Citation mounce (Section "a-1a(2a)"), Citation mounce (Page 224)])
     [adjectiveCategory|
      Special Paradigm: πολύς
              m:       f:       n:
      nom sg: πολύς    πολλή    πολύ
      gen sg: πολλοῦ   πολλῆς   πολλοῦ
      dat sg: πολλῷ    πολλῇ    πολλῷ
      acc sg: πολύν    πολλήν   πολύ
      voc sg: *        *        *
      nom pl: πολλοί   πολλαί   πολλά
      gen pl: πολλῶν   πολλῶν   πολλῶν
      dat pl: πολλοῖς  πολλαῖς  πολλοῖς
      acc pl: πολλούς  πολλάς   πολλά
      voc pl: *        *        *
      lemmas:
      	πολύς
	|]
   , mounce § "a-1a(2b)" $
     [adjectiveCategory|
      Uncontracted stems using three endings (2-1-2) with the feminine in η and neuter in ο
              m:  f:  n:
      nom sg: ος  η   ο
      gen sg: ου  ης  ου
      dat sg: ῳ   ῃ   ῳ
      acc sg: ον  ην  ο
      voc sg: *   *   *
      nom pl: οι  αι  α
      gen pl: ων  αν  ων
      dat pl: οις αις οις
      acc pl: ους ας  α
      voc pl: οι  αι  α
      lemmas:
      	ἀλλήλος ἄλλος αὐτός ἑαυτος ἐκεῖνος
      	ἐμαυτος οὗτος σεαυτος τηλικοῦτος τοιοῦτος 
      	τοσοῦτος
    |]
    -- Mounce has: ὅδε ὅσπερ ὅστις τοιόσδε
   , Cited ([Citation mounce (Section "a-1a(2b)"), Citation mounce (Page 225)])
     [adjectiveCategory|
      Special Paradigm: The Article 
              m:   f:   n:
      nom sg: ὁ    ἡ    τό
      gen sg: τοῦ  τῆς  τοῦ
      dat sg: τῷ   τῇ   τῷ
      acc sg: τόν  τήν  τό
      voc sg: *    *    *
      nom pl: οἱ   αἱ   τά
      gen pl: τῶν  τῶν  τῶν
      dat pl: τοῖς ταῖς τοῖς
      acc pl: τούς τάς  τά
      voc pl: *    *    *
      lemmas:
      	ὁ 
    |]
   , Cited ([Citation mounce (Section "a-1a(2b)"), Citation mounce (Page 226)])
     [adjectiveCategory|
      Special Paradigm: The Relative Pronoun 
              m:   f:   n:
      nom sg: ὅς   ἥ    ὅ
      gen sg: οὗ   ἧς   οὗ
      dat sg: ᾧ    ᾗ    ᾧ
      acc sg: ὅν   ἥν   ὅ
      voc sg: *    *    *
      nom pl: οἵ   αἵ   ἅ
      gen pl: ὧν   ὧν   ὧν
      dat pl: οἷς  αἷς  οἷς
      acc pl: οὕς  ἅς   ἅ
      voc pl: *    *    *
      lemmas: 
      	ὅς 
    |]
   , Cited ([Citation mounce (Section "a-1a(2b)"), Citation mounce (Page 226)])
     [adjectiveCategory|
      Special Paradigm: ὅστις
              m:         f:         n:
      nom sg: ὅστις      ἥτις       ὅτι
      gen sg: οὗτινος    ἧστινος    οὗτινος
      dat sg: ᾧτινι      ᾗτινι      ᾧτινι
      acc sg: ὅντινα     ἥντινα     ὅτι
      voc sg: *          *          *
      nom pl: οἵτινες    αἵτινες    ἅτινα
      gen pl: ὧντινων    ὧντινων    ὧντινων
      dat pl: οἷστισι    αἷστισι    οἷστισι
      acc pl: οὕστινας   ἅστινας    ἅτινα
      voc pl: *          *          *
      lemmas:  
      	ὅστις
    |]
  , mounce § "a-1b" $
     [adjectiveCategory|
      Contract adjectives using three endings (2-1-2)
              m:   f:  n:
      nom sg: οῦς  ἥ   οῦν
      gen sg: οῦ   ἧς  οῦ
      dat sg: ῷ    ᾗ   ῷ
      acc sg: οῦν  ἥν  οῦν
      voc sg: *    *   *
      nom pl: οῖ   αἵ  ᾶ
      gen pl: ὧν   ὧν  ῶν
      dat pl: οἷς  αἷς οῖς
      acc pl: οὕς  ἅς  ᾶ
      voc pl: *    *   *
      lemmas:  
        ἁπλοῦς ἀργυροῦς διπλοῦς πορφυροῦς σιδηροῦς
        τετραπλοῦς χαλκοῦς χρυσοῦς
    |]
  , mounce § "a-2a" $
     [adjectiveCategory|
      Stems ending in ντ using three endings (3-1-3)
              m:  f:  n:
      nom sg: ς   α   -
      gen sg: ός  ης  ός
      dat sg: ί   ῃ   ί
      acc sg: α   αν  -
      voc sg: *   *   *
      nom pl: ες  αι  α
      gen pl: ων  ῶν  ων
      dat pl: ί   αις ι
      acc pl: ας  ας  α
      voc pl: ες  αι  α
      lemmas:  
       ἄκός ἅπας ἑκός μέλας
       μηδείς οὐδείς οὐθείς πᾶς
    |]
  , Cited ([Citation mounce (Section "a-2a"), Citation mounce (Page 229)])
     [adjectiveCategory|
       Special Paradigm: εἷς, μία, ἕν
              m:   f:   n:
      nom sg: εἷς  μία  ἕν
      gen sg: ἑνός μιᾶς ἑνός
      dat sg: ἑνί  μιᾷ  ἑνί
      acc sg: ἑνά  μίαν ἕν
      voc sg: *    *    *   
      nom pl: *    *    *
      gen pl: *    *    *
      dat pl: *    *    *
      acc pl: *    *    *
      voc pl: *    *    *
      lemmas:  
        εἷς
    |]
  , Cited ([Citation mounce (Section "a-2a"), Citation mounce (Page 229)])
     [adjectiveCategory|
       Special Paradigm: μελας
              m:        f:         n:
      nom sg: μελας     μελαινα    μελαν
      gen sg: μελανος   μελαινης   μελανος
      dat sg: μελανι    μελαινῃ    μελανι
      acc sg: μελανα    μελαιναν   μελαν
      voc sg: *         *          *
      nom pl: μελανες   μελαιναι   μελανα
      gen pl: μελανων   μελαινων   μελανων
      dat pl: μελασι    μελαιναις  μελασι
      acc pl: μελανασ   μελαινας   μελανα
      voc pl: *         *          *
      lemmas:  
        μελας
    |]
  , mounce § "a-2b" $
     [adjectiveCategory|
      Stems ending in digamma using three endings (3-1-3)
              m:   f:    n:
      nom sg: υς   εια   -
      gen sg: εως  ειας  εως
      dat sg: ει   ειᾳ   ει
      acc sg: υν   ειαν  -
      voc sg: *    *     *
      nom pl: εις  ειαν  εα
      gen pl: εων  ειων  εων
      dat pl: εσι  ειαις εσι
      acc pl: εις  ειας  εα
      voc pl: *    *     *
      lemmas:  
        βαθύς βαρύς βραδύς βραχύς γλυκύς
        εὐθύς ἥμισυς θῆλυς ὀξύς πλατύς
        πραΰς ταχύς τραχύς
    |]
  , mounce §§ ["a-3a", "a-3b(1)", "a-3b(2)"] $
    [adjectiveCategory|
      Stems consistently using two endings (2-2)
              mf: n:
      nom sg: ος  ον
      gen sg: ου  ου
      dat sg: ῳ   ῳ
      acc sg: ον  ον
      voc sg: ε   ον
      nom pl: οι  α
      gen pl: ων  ων
      dat pl: οις οις
      acc pl: ους α
      voc pl: οι  α
      lemmas:
        ἀγαθοεργός ἀγαθοποιός ἀγενεαλόγητος ἄγναφος ἄγνωστος
        ἀγοραῖος ἀγράμματος ἀδάπανος ἄδηλος ἀδιάκριτος
        ἀδιάλειπτος ἄδικος ἀδόκιμος ἄδολος ἀδύνατος
        ἄζυμος ἀθέμιτος ἄθεος ἄθεσμος ἀθῷος
        ἀΐδιος αἰφνίδιος ἀκάθαρτος ἄκακος ἄκαρπος
        ἀκατάγνωστος ἀκατακάλυπτος ἀκατάκριτος ἀκατάλυτος ἀκατάπαστος
        ἀκατάπαυστος ἀκατάστατος ἀκατάσχετος ἀκέραιος ἄκρατος
        ἀλάλητος ἄλαλος ἀλλόφυλος ἄλογος ἄλυπος
        ἀμάραντος ἀμάρτυρος ἀμαρτωλός ἄμαχος ἄμεμπτος
        ἀμέριμνος ἀμετάθετος ἀμετακίνητος ἀμεταμέλητος ἀμετανόητος
        ἄμετρος ἀμίαντος ἀμώμητος ἄμωμος ἀναίτιος
        ἄναλος ἀναμάρτητος ἀναντίρρητος ἀνάξιος ἀνάπειρος
        ἀνάπηρος ἀναπολόγητος ἀναρίθμητος ἀνέγκλητος ἀνεκδιήγητος
        ἀνεκλάλητος ἀνέκλειπτος ἀνεκτός ἀνέλεος ἀνένδεκτος
        ἀνεξεραύνητος ἀνεξίκακος ἀνεξιχνίαστος ἀνεπαίσχυντος ἀνεπίλημπτος
        ἀνεύθετος ἀνήμερος ἀνθρωπάρεσκος ἄνιπτος ἀνόητος
        ἄνομος ἀνόνητος ἀνόσιος ἀντίτυπος ἄνυδρος
        ἀνυπόκριτος ἀνυπότακτος ἀόρατος ἀπαίδευτος ἀπαράβατος
        ἀπαρασκεύαστος ἀπείραστος ἄπειρος ἀπέραντος ἀπερίτμητος
        ἄπιστος ἀπόβλητος ἀπόδεκτος ἀπόδημος ἀπόκρυφος
        ἀποσυνάγωγος ἀπρόσιτος ἀπρόσκοπος ἄπταιστος ἄραφος
        ἄρρητος ἄρρωστος ἀρτιγέννητος ἀρχιερατικός ἀσάλευτος
        ἄσβεστος ἄσημος ἄσιτος ἄσοφος ἄσπιλος
        ἄσπονδος ἀστήρικτος ἄστοργος ἀσύμφωνος ἀσύνετος
        ἀσύνθετος ἄτακτος ἄτεκνος ἄτιμος ἄτομος
        ἄτοπος αὐθαίρετος αὐτοκατάκριτος αὐτόφωρος ἄφαντος
        ἄφθαρτος ἀφιλάγαθος ἀφιλάργυρος ἄφωνος ἀχάριστος
        ἀχειροποίητος ἀχρεῖος ἄχρηστος ἄψυχος βάρβαρος
        βαρύτιμος βασίλειος βέβηλος βλάσφημος βοηθός
        βρώσιμος γενέθλιος γνώριμος δευτερόπρωτος διάβολος
        διάφορος δίγαμος διθάλασσος δίλογος δίστομος
        δίψυχος δόκιμος δυσβάστακτος δυσερμήνευτος δύσκολος
        δυσνόητος ἔγγυος ἐγκάθετος ἔγκυος εἰδωλόθυτος
        εἰρηνοποιός ἔκγονος ἔκδηλος ἔκδικος ἔκδοτος
        ἔκθαμβος ἔκθετος ἔκτρομος ἔκφοβος ἔμφοβος
        ἔμφυτος ἐνάλιος ἔνδικος ἔνδοξος ἔννομος
        ἔννυχος ἔνοχος ἔντιμος ἔντρομος ἔξυπνος
        ἐπάρατος ἐπάρχειος ἐπαυτόφωρος ἐπίγειος ἐπιθανάτιος
        ἐπικατάρατος ἐπίλοιπος ἐπίορκος ἐπιούσιος ἐπιπόθητος
        ἐπίσημος ἐπουράνιος ἔρημος ἑτερόγλωσσος εὐάρεστος
        εὔθετος εὔθυμος εὔκαιρος εὔκοπος εὐμετάδοτος
        εὐπάρεδρος εὐπερίσπαστος εὐπερίστατος εὐπρόσδεκτος εὐπρόσεδρος
        εὐρύχωρος εὔσημος εὔσπλαγχνος εὔφημος εὐχάριστος
        εὔχρηστος εὐώνυμος ἐφήμερος ἤρεμος ἡσύχιος
        θανάσιμος θανατηφόρος θεοδίδακτος θεοδίδακτος θεομάχος
        θεόπνευστος θρησκός ἱερόθυτος ἰσάγγελος ἰσότιμος
        ἰσόψυχος κακοποιός κακοῦργος καλοδιδάσκαλος καρποφόρος
        κατάδηλος κατάλαλος κατάλοιπος καταχθόνιος κατείδωλος
        κενόδοξος λιθόστρωτος μακροχρόνιος ματαιολόγος μελίσσιος
        μεμψίμοιρος μέτοχος μογγιλάλος μογιλάλος μονόφθαλμος
        νεόφυτος οἰκουργός οἰκουρός ὀκταήμερος ὀλέθριος
        ὀλιγόπιστος ὀλιγόψυχος ὁλόκληρος ὁμότεχνος οὐράνιος
        ὄψιμος πανοῦργος παράδοξος παράλιος παράσημος
        παρείσακτος παρεπίδημος πάροικος πάροινος πατροπαράδοτος περίεργος περίλυπος περίοικος περιούσιος
        περίχωρος πλάνος πολύλαλος πολυποίκιλος πολύσπλαγχνος
        πολυεύστλαγχνος πολύτιμος πορφύρεος ποταμοφόρητος πρόγονος
        πρόδηλος πρόδρομος πρόθυμος πρόϊμος πρόσκαιρος
        πρόσπεινος πρόσφατος πρώϊμος πρωτότοκος σητόβρωτος
        σκληροτράχηλος σκωληκόβρωτος σπερμολόγος σπόριμος συγκληρονόμος
        συμμέτοχος σύμμορφος σύμφορος σύμφυτος σύμφωνος
        σύμψυχος σύντροφος σύσσωμος σωτήριος ταλαίπωρος
        τετράγωνος τετράμηνος τρίμηνος ὕπανδρος ὑπέρακμος
        ὑπερήφανος ὑπέρογκος ὑπήκοος ὑπόδικος φιλάγαθος
        φιλάδελφος φίλανδρος φιλάργυρος φίλαυτος φιλήδονος
        φιλόθεος φιλόνεικος φιλόξενος φιλόστοργος φιλότεκνος
        φλύαρος φρόνιμος φωσφόρος χειροποίητος χρυσοδακτύλιος 
        ψευδολόγος ψευδώνυμος ὠφέλιμος 

        αἰώνιος ἑδραῖος κόσμιος οἰκεῖος παρόμοιος 

        ἕτοιμος πτηνός σκυθρωπός
     |]
  , mounce § "a-4a" $
    [adjectiveCategory|
      Stems ending in ες
              mf: n:
      nom sg: ής  ές
      gen sg: οῦς οῦς
      dat sg: εῖ  εῖ
      acc sg: θῆ  ές
      voc sg: *   *
      nom pl: εῖς θῆ
      gen pl: ῶν  ῶν
      dat pl: έσι έσι
      acc pl: εῖς θῆ
      voc pl: *   *
      lemmas:
        ἀβαρής ενής αἰσχροκερδής ἀκλινής ἀκρατής
        ἀκριβής ἀληθής ἀλλογενής ἀλυσιτελής ἀμαθής
        ἀνωφελής ἀπειθής ἀσεβής ἀσθενής ἀσφαλής
        αὐθάδης αὐτάρκης ἀφανής ἀψευδής γραώδης
        δαιμονιώδης διαυγής διαφανής διετής διηνεκής 
        διοπετής ἐγκρατής εἰλικρινής ἑκατονταετής
        ἐκτενής ἐμφανής ἐναργής ἐνδεής ἐνεργής
        ἐπιεικής ἐπισφαλής ἐπιφανής εὐγενής εὐλαβής
        εὐπειθής εὐσεβής ἡμιθανής θειώδης θεοσεβής
        θεοστυγής ἱεροπρεπής μεγαλοπρεπής μονογενής ὁλοτελής
        ὁμοιοπαθής παντελής περικρατής πετρώδης πλήρης
        ποδήρης πολυτελής πρηνής προπετής προσφιλής 
        συγγενής συμπαθής τεσσερακονταετής τεσσερακονταετής
        τρεῖς ὑγιής ψευδής
      |]
  , Cited ([Citation mounce (Section "a-4a"), Citation mounce (Page 236)])
     [adjectiveCategory|
       Special Paradigm: The stem τρεσ uses ες in both the nominative and accusative masculine/feminine.
              mf:   n:
      nom sg: *     *
      gen sg: *     *    
      dat sg: *     *     
      acc sg: *     *     
      voc sg: *     *
      nom pl: τρεῖς τρία
      gen pl: τριῶν τριῶν
      dat pl: τρισί τρισί
      acc pl: τρεῖς τρία
      voc pl: *     *
      lemmas:  
        τρεῖς
    |]
  , mounce § "a-4b(1)" $
    [adjectiveCategory|
      Stems ending in ον
              mf:  n:
      nom sg: ων   ον
      gen sg: ονος ονος
      dat sg: ονι  ονι
      acc sg: ονα  ον
      voc sg: *    *
      nom pl: ονες ονα
      gen pl: όνων όνων
      dat pl: οσι  οσι
      acc pl: ονας ονα
      voc pl: *    *
      lemmas:
        ἀνελεήμων ἀσχήμων ἄφρων βελτίων δεισιδαίμων
        ἑκατον ταπλασίων ἐλάσσων ἐλάττων ἐλεήμων
        ἐπιστήμων ἑπταπλασίων εὐσχήμων ἥσσων ἥττων
        κρείσσων κρείττων μείζων οἰκτίρμων ὁμόφρων
        πλείων πολλαπλασίων σώφρων ταπεινόφρων
        φιλόφρων χείρων
      |]
  , mounce § "a-4b(2)" $
    [adjectiveCategory|
      Stems ending in ν
              mf:  n:
      nom sg: ς    -
      gen sg: ος   ος
      dat sg: ι    ι
      acc sg: α    -
      voc sg: *    *
      nom pl: ες   α
      gen pl: ων   ων
      dat pl: σι   σι
      acc pl: ας   α
      voc pl: *    *
      lemmas:
        τίς
      |]
  , mounce § "a-4c" $
    [adjectiveCategory|
      Miscellaneous 3-3 stems
              mf:  n:
      nom sg: ην   εν
      gen sg: ενος ενος
      dat sg: ενι  ενι
      acc sg: ενα  εν
      voc sg: *    *
      nom pl: ες   α
      gen pl: ων   ων
      dat pl: σι   σι
      acc pl: ας   α
      voc pl: *    *
      lemmas:
        ἀμήτωρ ορος ἀπάτωρ ορος ἄρρην 
        εν ἄρσην 
      |]
  , mounce § "a-5" $
    [adjectiveCategory|
      Irregular Stems
              mf:  n:
      nom sg: δύο  *
      gen sg: δύο  *
      dat sg: δυσί *
      acc sg: δύο  *
      voc sg: *    *
      nom pl: *    *
      gen pl: *    *
      dat pl: *    *
      acc pl: *    *
      voc pl: *    *
      lemmas:
        δύο
      |]
  ]

